Rappels

Filtrage

In [2]:
import numpy as np 
import pandas as pd 
df = pd.DataFrame(np.arange(16).reshape(4,4), index=["Ohio", "Colorado", "Utah", "New York"], columns=["one", "two", "three", "four"])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [9]:
# Selectionner une sous-partie du DF
# .loc() : requête par nom
df.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [11]:
df.loc[:"Utah", "two"]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [12]:
# Selectionner une sous-partie du DF
# .iloc() : requête par position (numéro de ligne/colonne)
df.iloc[2]

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int64

In [27]:
# Selectionner une sous-partie du DF
# approche hybride
df[df.three > 5].iloc[:,:3]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [3]:
# Selectionner une sous-partie du DF
# Traiter les cas plus complexes
df.loc[lambda df: df.index.str.len() > 4]

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

Données manquantes

In [29]:
string_data = pd.Series(["aarggfx", "artichaut", np.nan, "avocado"])
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [30]:
# Par défaut, .dropna() supprime des lignes ("axis = 0")
df_with_na = pd.DataFrame([[1, np.nan], [2, 3]], index= ["a", "b"])
df_with_na.dropna()

0      aarggfx
1    artichaut
3      avocado
dtype: object

In [37]:
# Il peut aussi supprimer des colonnes
df_with_na.dropna(axis=1)

   0
a  1
b  2

In [39]:
# .fillna()
value_to_replace_na_with = 0
df_with_na.fillna(value_to_replace_na_with)

   0    1
a  1  0.0
b  2  3.0

Exercices

In [ ]:
# Lire les données du Titanic
# Créer un dataframe avec 100 lignes

# Filtrer le df pour n'obtenir que les hommes qui ont payé plus de 50$
# Combien y en a-t-il ?

In [ ]:
# Filtrer le df pour n'obtenir que les femmes de moins de 18 ans
# Combien y en a-t-il ?

In [ ]:
# Remplacer les valeurs manquantes de la colonne prix par le prix moyen, et les lieux d'embarquement manquants par "C"
# Est-il possible de faire cela en un seul appel ?

In [ ]:
# Supprimer les lignes où l'âge est manquant

In [4]:
# Créer une fonction qui effectue les opérations des trois cellules précédentes

In [ ]:
# Bonus : filtrage avancé
# Filtrer le df suivant pour ne garder que les lignes où le prénom commence par un "A"
data = {"prenom" : ["Anna", "Ben", "Camille"], "poste": ["DE", "DE", "DS"]}
df = pd.DataFrame(data)